Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71Q21B.PIC
      <edc:SFRDef edc:_addr="0x400005C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO241" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO242" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO243" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO244" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO245" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO246" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO247" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO248" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO249" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005E8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO250" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005EC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO251" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO252" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005F4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO253" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005F8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO254" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400005FC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="HSMCI_FIFO255" edc:nzwidth="0x20" ltx:memberofperipheral="HSMCI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data to Read or Data to Write" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000600" edc:offset="0x3A00"/>
      <edc:SFRDef edc:_addr="0x40004000" edc:access="----------------w-----ww------ww" edc:cname="SSC_CR" edc:impl="0x8303" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receive Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receive Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmit Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmit Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004004" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SSC_CMR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Clock Divider" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40004008" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40004010" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:cname="SSC_RCMR" edc:impl="0xFFFF1FFF" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="CKS" edc:desc="Receive Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Divided Clock" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TK" edc:desc="TK Clock signal" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RK" edc:desc="RK pin" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKO" edc:desc="Receive Clock Output Mode Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, RK pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous Receive Clock, RK pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRANSFER" edc:desc="Receive Clock only during data transfers, RK pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKI" edc:desc="Receive Clock Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKG" edc:desc="Receive Clock Gating Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="EN_RF_LOW" edc:desc="Receive Clock enabled only if RF Low" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EN_RF_HIGH" edc:desc="Receive Clock enabled only if RF High" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Receive Start Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data." edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRANSMIT" edc:desc="Transmit start" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RF_LOW" edc:desc="Detection of a low level on RF signal" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RF_HIGH" edc:desc="Detection of a high level on RF signal" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="RF_FALLING" edc:desc="Detection of a falling edge on RF signal" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="RF_RISING" edc:desc="Detection of a rising edge on RF signal" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="RF_LEVEL" edc:desc="Detection of any level change on RF signal" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="RF_EDGE" edc:desc="Detection of any edge on RF signal" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CMP_0" edc:desc="Compare 0" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Receive Stop Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="STTDLY" edc:desc="Receive Start Delay" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:desc="Receive Period Divider Selection" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004014" edc:access="nnnn---n-nnnnnnn----nnnnn-nnnnnn" edc:cname="SSC_RFMR" edc:impl="0xF17F0FBF" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="DATLEN" edc:desc="Data Length" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="LOOP" edc:desc="Loop Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MSBF" edc:desc="Most Significant Bit First" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATNB" edc:desc="Data Number per Frame" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FSLEN" edc:desc="Receive Frame Sync Length" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FSOS" edc:desc="Receive Frame Sync Output Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, RF pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Pulse, RF pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Pulse, RF pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Driven Low during data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Driven High during data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLING" edc:desc="Toggling at each start of data transfer, RF pin is an output" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEDGE" edc:desc="Frame Sync Edge Detection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="POSITIVE" edc:desc="Positive Edge Detection" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NEGATIVE" edc:desc="Negative Edge Detection" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FSLEN_EXT" edc:desc="FSLEN Field Extension" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
