Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71Q21B.PIC
      <edc:SFRDef edc:_addr="0x40038808" edc:access="---------------------------w----" edc:cname="USBHS_SCR" edc:impl="0x10" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RDERRIC" edc:desc="Remote Device Connection Error Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003880C" edc:access="----------------------w----w----" edc:cname="USBHS_SFR" edc:impl="0x210" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RDERRIS" edc:desc="Remote Device Connection Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="VBUSRQS" edc:desc="VBUS Request Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038810" edc:offset="0x37F0"/>
      <edc:SFRDef edc:_addr="0x4003C000" edc:access="------------------------------ww" edc:cname="AFEC0_CR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C004" edc:access="n-nnnnnnn---nnnnnnnnnnnnnnn-nnnn" edc:cname="AFEC0_MR" edc:impl="0xBF8FFFEF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="TRGEN" edc:desc="Trigger Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Hardware triggers are disabled. Starting a conversion is only possible by software." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Hardware trigger selected by TRGSEL field is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:desc="Trigger Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="AFEC_TRIG0" edc:desc="AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AFEC_TRIG1" edc:desc="TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AFEC_TRIG2" edc:desc="TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AFEC_TRIG3" edc:desc="TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFEC_TRIG4" edc:desc="PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFEC_TRIG5" edc:desc="PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFEC_TRIG6" edc:desc="Analog Comparator" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="Sleep Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode: The AFE and reference voltage circuitry are kept ON between conversions." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="Sleep mode: The AFE and reference voltage circuitry are OFF between conversions." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FWUP" edc:desc="Fast Wake-up" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Normal Sleep mode: The sleep mode is defined by the SLEEP bit." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FREERUN" edc:desc="Free Run Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Normal mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Free Run mode: Never wait for any trigger." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCAL" edc:desc="Prescaler Rate Selection" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Start-up Time" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="SUT0" edc:desc="0 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUT8" edc:desc="8 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SUT16" edc:desc="16 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SUT24" edc:desc="24 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SUT64" edc:desc="64 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SUT80" edc:desc="80 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="SUT96" edc:desc="96 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SUT112" edc:desc="112 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="SUT512" edc:desc="512 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SUT576" edc:desc="576 periods of AFE clock" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="SUT640" edc:desc="640 periods of AFE clock" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="SUT704" edc:desc="704 periods of AFE clock" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SUT768" edc:desc="768 periods of AFE clock" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="SUT832" edc:desc="832 periods of AFE clock" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="SUT896" edc:desc="896 periods of AFE clock" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SUT960" edc:desc="960 periods of AFE clock" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:desc="One" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRACKTIM" edc:desc="Tracking Time" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TRANSFER" edc:desc="Transfer Period" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="USEQ" edc:desc="User Sequence Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NUM_ORDER" edc:desc="Normal mode: The controller converts channels in a simple numeric order." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REG_ORDER" edc:desc="User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C008" edc:access="--nn--nn-----nnn--nn--n-nnnnn-nn" edc:cname="AFEC0_EMR" edc:impl="0x330732FB" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:desc="Comparison Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPSEL" edc:desc="Comparison Selected Channel" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPALL" edc:desc="Compare All Channels" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMPFILTER" edc:desc="Compare Event Filtering" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RES" edc:desc="Resolution" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_AVERAGE" edc:desc="12-bit resolution, AFE sample rate is maximum (no averaging)." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR4" edc:desc="13-bit resolution, AFE sample rate divided by 4 (averaging)." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR16" edc:desc="14-bit resolution, AFE sample rate divided by 16 (averaging)." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR64" edc:desc="15-bit resolution, AFE sample rate divided by 64 (averaging)." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR256" edc:desc="16-bit resolution, AFE sample rate divided by 256 (averaging)." edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TAG" edc:desc="TAG of the AFEC_LDCR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STM" edc:desc="Single Trigger Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SIGNMODE" edc:desc="Sign Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SE_UNSG_DF_SIGN" edc:desc="Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SE_SIGN_DF_UNSG" edc:desc="Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ALL_UNSIGNED" edc:desc="All channels: Unsigned conversions." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ALL_SIGNED" edc:desc="All channels: Signed conversions." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C00C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_SEQ1R" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="USCH0" edc:desc="User Sequence Number 0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH1" edc:desc="User Sequence Number 1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH2" edc:desc="User Sequence Number 2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH3" edc:desc="User Sequence Number 3" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH4" edc:desc="User Sequence Number 4" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH5" edc:desc="User Sequence Number 5" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH6" edc:desc="User Sequence Number 6" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH7" edc:desc="User Sequence Number 7" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C010" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="AFEC0_SEQ2R" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="USCH8" edc:desc="User Sequence Number 8" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH9" edc:desc="User Sequence Number 9" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH10" edc:desc="User Sequence Number 10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH11" edc:desc="User Sequence Number 11" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C014" edc:access="--------------------wwwwwwwwwwww" edc:cname="AFEC0_CHER" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C018" edc:access="--------------------wwwwwwwwwwww" edc:cname="AFEC0_CHDR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C01C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="AFEC0_CHSR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C020" edc:access="----rrrr--------rrrrrrrrrrrrrrrr" edc:cname="AFEC0_LCDR" edc:impl="0xF00FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="LDATA" edc:desc="Last Data Converted" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNB" edc:desc="Channel Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C024" edc:access="-w---www------------wwwwwwwwwwww" edc:cname="AFEC0_IER" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Enable 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C028" edc:access="-w---www------------wwwwwwwwwwww" edc:cname="AFEC0_IDR" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Disable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Disable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Disable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Disable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Disable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Disable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Disable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Disable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Disable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Disable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Disable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Disable 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
