Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71Q21B.PIC
      <edc:AdjustPoint edc:_addr="0x40050414" edc:offset="0x2C"/>
      <edc:SFRDef edc:_addr="0x40050440" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_TBQBAPQ0" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXBQBA" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050444" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_TBQBAPQ1" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXBQBA" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050448" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_TBQBAPQ2" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXBQBA" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005044C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_TBQBAPQ3" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXBQBA" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050450" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_TBQBAPQ4" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXBQBA" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050454" edc:offset="0x2C"/>
      <edc:SFRDef edc:_addr="0x40050480" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_RBQBAPQ0" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXBQBA" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050484" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_RBQBAPQ1" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXBQBA" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050488" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_RBQBAPQ2" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXBQBA" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005048C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_RBQBAPQ3" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXBQBA" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050490" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_RBQBAPQ4" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXBQBA" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050494" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400504A0" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_RBSRPQ0" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RBS" edc:desc="Receive Buffer Size" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400504A4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_RBSRPQ1" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RBS" edc:desc="Receive Buffer Size" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400504A8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_RBSRPQ2" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RBS" edc:desc="Receive Buffer Size" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400504AC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_RBSRPQ3" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RBS" edc:desc="Receive Buffer Size" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400504B0" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_RBSRPQ4" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RBS" edc:desc="Receive Buffer Size" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
