Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71Q21B.PIC
      <edc:AdjustPoint edc:_addr="0x40080010" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x40080080" edc:access="--------------------nnnn-------n" edc:cname="SMC_OCMS" edc:impl="0xF01" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="SMSE" edc:desc="Static Memory Controller Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CS0SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS1SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS2SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS3SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080084" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY1" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="KEY1" edc:desc="Off-Chip Memory Scrambling (OCMS) Key Part 1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080088" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY2" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="KEY2" edc:desc="Off-Chip Memory Scrambling (OCMS) Key Part 2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4008008C" edc:offset="0x58"/>
      <edc:SFRDef edc:_addr="0x400800E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="SMC_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400800E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="SMC_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400800EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40084000" edc:access="-----------------------------nnn" edc:cname="SDRAMC_MR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="SDRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDRAMC">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="SDRAMC Command Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, the command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NOP" edc:desc="The SDRAMC issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ALLBANKS_PRECHARGE" edc:desc="The SDRAMC issues an &quot;All Banks Precharge&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="LOAD_MODEREG" edc:desc="The SDRAMC issues a &quot;Load Mode Register&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_REFRESH" edc:desc="The SDRAMC issues an &quot;Auto-Refresh&quot; Command when the SDRAM device is accessed regardless of the cycle. Previously, an &quot;All Banks Precharge&quot; command must be issued. To activate this mode, the command must be followed by a write to the SDRAM." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="EXT_LOAD_MODEREG" edc:desc="The SDRAMC issues an &quot;Extended Load Mode Register&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the &quot;Extended Load Mode Register&quot; command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DEEP_POWERDOWN" edc:desc="Deep Power-down mode. Enters Deep Power-down mode." edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
