Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71Q21B.PIC
      <edc:SFRDef edc:_addr="0x400E1298" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIOC_PPDSR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOC">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Pull-Down Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E129C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E12A0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOC_OWER" edc:nzwidth="0x20" ltx:memberofperipheral="PIOC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOC">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Output Write Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E12A4" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOC_OWDR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOC">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Output Write Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E12A8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIOC_OWSR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOC">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Output Write Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E12AC" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E12B0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOC_AIMER" edc:nzwidth="0x20" ltx:memberofperipheral="PIOC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOC">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Additional Interrupt Modes Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E12B4" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOC_AIMDR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOC">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Additional Interrupt Modes Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
